import { Authors, Books } from '../enums';
import { BookMetadata } from '../interfaces';

/** Books collection data */
export const BooksCollection: BookMetadata[] = [
  {
    id: 1,
    title: Books['Сосни'],
    coverImage: '3Dgf6NqNNX8hXpw6HwpbsYhCbfamClcijxoXFSJH.jpg.webp',
    authors: [Authors['Блейк Крауч']],
    description: [
      `На перший погляд Облудні Сосни, що в штаті Айдахо, - звичайнісіньке американське містечко. Агент секретної служби Ітан Берк прибуває туди в пошуках двох зниклих колег, та невдовзі потрапляє в абсолютно непередбачену ситуацію. Опинившись у шпиталі після страшної аварії, Ітан приходить до тями без посвідчення і телефону. Медперсонал поводиться доволі чемно, але тут напевне щось... не так.`,
      `Дні спливають, однак розшук колег приносить Ітану більше питань, ніж відповідей. Чому він не може вийти на зв’язок із родиною? Чому жодна людина не вірить у те, що Ітан - федеральний агент? І для чого потрібні електричні паркани, що оточують місто? Тримати мешканців в межах Облудних Сосен? Чи задля захисту від когось за межами міста?`,
      `Кожен крок до правди віддаляє Ітана від звичного світу, аж поки не настає моторошне усвідомлення: можливо, він вже ніколи не вибереться з Облудних Сосен живим...`,
    ],
    contents: [
      { authors: [Authors['Блейк Крауч']], title: Books['Сосни'] },
    ],
  },
  {
    id: 2,
    title: Books['Облуда'],
    coverImage: 'yNX29JPRyZNYy5lZ5yVzxQ7JulSJnrDwsGUeX0se.jpg.webp',
    authors: [Authors['Блейк Крауч']],
    description: [
      `Вітаємо в Облудних Соснах, популяція - 461 житель. Розташоване поміж мальовничих, немов на листівках, гір, це ідилічне містечко - сучасна версія Едему, от тільки навколо обплутана колючим дротом загорожа під високою напругою, снайпери чергують 24 години на добу і 7 днів на тиждень, а невпинний нагляд фіксує кожне слово або жест.`,
      `Ніхто з жителів міста не знає, як опинився тут. За них вирішують, де працювати, як жити і з ким одружуватися. Дехто вірить, що живе після смерті. Деякі дійшли висновку, що стали примусовими учасниками незрозумілого експерименту. Усі потай мріють про втечу, але на тих кількох, хто насмілюється спробувати це зробити, чатує моторошна несподіванка.`,
      `Ітан Берк побачив світ за загорожею. Він - шериф, один із небагатьох, кому відома правда: Облудні Сосни - не просто місто. І життя по той бік загорожі, - кошмар, який годі уявити.`,
    ],
    contents: [
      { authors: [Authors['Блейк Крауч']], title: Books['Облуда'] },
    ],
  },
  {
    id: 3,
    title: Books['Останнє місто'],
    coverImage: 'jzrI11YcrXDNAEgBhnGGed0JvfRbqPpeoS6k54ix.jpg.webp',
    authors: [Authors['Блейк Крауч']],
    description: [
      `Ласкаво просимо до міста Облудні Сосни, останнього міста на Землі!`,
      `Агент секретної служби Ітан Берк з’явився тут три тижні тому. В цьому місті людям вказують, де жити, з ким одружуватись, ким працювати. Дітей навчають, що Девід Пілчер, засновник міста, - це бог. Нікому не дозволяється залишати Сосни; не можна навіть розпитувати, що тут, власне, відбувається.`,
      `Однак Ітан розкрив вражаючу таємницю: він дізнався про життя по той бік електрифікованої загорожі. Виявляється, населення міста контролює безумець; а ще є істоти, які можуть прорватися крізь загорожу і знищити цей останній крихкий уламок людської цивілізації.`,
    ],
    contents: [
      { authors: [Authors['Блейк Крауч']], title: Books['Останнє місто'] },
    ],
  },
  {
    id: 4,
    title: Books['Апґрейд'],
    coverImage: 'nQHFlNOy8xbwXEnYfoRK2Q9XPhh3tJR8gONTEWIb.jpg.webp',
    authors: [Authors['Блейк Крауч']],
    description: [
      `У романі Блейка Крауча «Апґрейд» читачі поринуть у світ не такого вже й далекого майбутнього, де людство стає на шлях кардинальних генетичних змін. Унаслідок цього знову доводиться шукати відповіді на запитання: хто така людина? що означає бути нею?`,
      `Лоґан Рамсей, колишній генетик, а тепер спецагент Управління з генетичної безпеки, стає об’єктом несанкціонованого експерименту, внаслідок чого він набуває надздібностей. Його життя докорінно змінюється. Ступивши на небезпечну стежку біохакінгу, корпоративного шпигунства та етичних проблем, Лоґан змушений протидіяти науковим новаціям, які мали б служити людям… Та чи це насправді так?`,
      `Автор «Апґрейду» так майстерно вибудовує оповідь, що тримає читачів у напрузі та затягує їх у лабіринт моральних дилем і карколомних відкриттів. І ніхто вже не в змозі відірватися від книжки!`,
    ],
    contents: [
      { authors: [Authors['Блейк Крауч']], title: Books['Апґрейд'] },
    ],
  },
  {
    id: 5,
    title: Books['Рекурсія'],
    coverImage: 'MRVcxF3JoVwxOSQKwiB59XyZLfs9HtSH6A66PedE.jpg.webp',
    authors: [Authors['Блейк Крауч']],
    description: [
      `Нейробіолог Гелена Сміт розробила пристрій, який має допомагати хворим людям зберегти спогади… Детектив Баррі Саттон розслідує самогубство жінки, що пам’ятає чоловіка і сина, яких у неї не було… Виявилося, що ігри з пам’яттю дуже небезпечні. Один необережний крок — і світ летить шкереберть…`,
      `Баррі та Гелена переконалися в цьому. Адже вони єдині розуміють першопричини низки катастроф. І лише вони можуть урятувати людство від загибелі в полум’ї ядерної війни. Треба тільки правильно вибрати спогад…`,
      `У романі «Рекурсія» Блейк Крауч не лише створив альтернативну реальність, а й змусив ще раз замислитися про те, що існування людства залежить від кожного з нас…`,
    ],
    contents: [
      { authors: [Authors['Блейк Крауч']], title: Books['Рекурсія'] },
    ],
  },
  {
    id: 6,
    title: Books['Темна матерія'],
    coverImage: 'hGXq26XTvbDYMwXobOoPE4crlge5nn3WKuTelixe.jpg.webp',
    authors: [Authors['Блейк Крауч']],
    description: [
      `«Чи задоволений ти своїм життям?» — це останні слова, які чує Джейсон Дессен, перш ніж втратити свідомість від удару викрадача у масці. Перш ніж прийти до тями прив’язаним до каталки в оточенні незнайомців у захисних костюмах. Перш ніж чоловік, якого Джейсон ніколи не бачив, усміхнеться йому й скаже: «З поверненням, друже».`,
      `У цьому світі в Джейсона зовсім інше життя. Його дружина — це не його дружина. І в нього ніколи не було сина. А сам Джейсон — не звичайний професор фізики в коледжі, а прославлений геній, який зробив щось визначне. Щось неможливе. Який із світів є сном, цей чи інший? І якщо навіть дім, який він пам’ятає, реальний, як Джейсон зможе повернутися до сім’ї, яку любить?`,
    ],
    contents: [
      { authors: [Authors['Блейк Крауч']], title: Books['Темна матерія'] },
    ],
  },
  {
    id: 7,
    title: Books['Убік'],
    coverImage: '15e0a8bc7.webp',
    authors: [Authors['Філіп К. Дік']],
    description: [
      `Перед вами світ майбутнього. Місяць був колонізований, частина людства володіє паранормальними вміннями і йде війна між телепатами і антителепатами. Смерті більше не існує, їй на зміну прийшли кріокамери. Новий світ мораторіумів, де століттями глибокозаморожені люди існують в безодні їх свідомості. Там вони продовжують жити, маючи можливість відчувати, думати і підтримувати зв'язки між собою і зовнішнім світом.`,
      `Глен Рансітер бос корпорації щодо запобігання телепатичного шпигунства. Він і його команда потрапляє в засідку влаштовану, очевидно, його суперниками, і Глена доводитися помістити в одну з таких кріокамер. Незабаром, виживші члени команди починають помічати деякі дивні явища, явно послані їм їх босом. І найдивніше, світ починає рух назад у часі, люди розчиняються, а технології стають все більш застарілими. У команди залишається все менше часу щоб з'ясувати, що викликає тимчасові зрушення і що таке таємничий Убік.`,
    ],
    contents: [
      { authors: [Authors['Філіп К. Дік']], title: Books['Убік'] },
    ],
  },
  {
    id: 8,
    title: Books['Чи мріють андроїди про електричних овець?'],
    coverImage: '280e6d431.webp',
    authors: [Authors['Філіп К. Дік']],
    description: [
      `Коли Рік Декард, мисливець за головами, отримує завдання ліквідувати групу андроїдів «Нексус-6», що нелегально проникли на планету Земля, він сприймає це як подарунок долі, як свій шанс врешті-решт втілити заповітну мрію свого життя – стати власником справжньої живої тварини. Однак у цьому похмурому постапокаліптичному світі ніщо не є настільки простим, як видається, і місія Декарда швидко перетворюється на кошмарний заплутаний калейдоскоп подвійної гри та обману, де мисливець, сам того не помічаючи, поступово перетворюється на здобич… Розмиваючи межі між людським та машинним, класика літературного кіберпанку, роман «Чи мріють андроїди про електричних овець?» (1968) культового американського фантаста Філіпа К. Діка (1928 – 1982) змушує нас по-новому поглянути на сутність того, що ми називаємо людським буттям. Роман є особливо актуальним сьогодні, коли симбіоз між біологічними формами та кібертехнологіями видається як ніколи реальним.`,
      `В 1982-му році роман було екранізовано знаменитим британським режисером Рідлі Скоттом під назвою "Той, що біжить по лезу/Blade Runner".`,
    ],
    contents: [
      { authors: [Authors['Філіп К. Дік']], title: Books['Чи мріють андроїди про електричних овець?'] },
    ],
  },
  {
    id: 9,
    title: Books['Ігрові консолі 2.0. Історія у фотографіях від Atari до Xbox'],
    coverImage: '5c13a44a-1d64-11ed-8173-0050568ef5e6_ede7e7b7-1d65-11ed-8173-0050568ef5e6.webp',
    authors: [Authors['Еван Амос']],
    description: [
      `«Ігрові консолі 2.0» пропонує унікальний погляд на найвідоміші у світі ігрові системи, їхні особливості та обладнання. Це ідеальний подарунок для всякого гіка та настільна книга кожного геймера.`,
      `Видання містить безліч класичних ігрових консолей і комп’ютерів, розділ про ретро-ігри в сучасності та десятки записів, зокрема надрідкісні знахідки, як-от Unisonic Champion 2711, та новітні консолі дев’ятого покоління. Ви знайдете інформацію про легендарні системи, такі як Magnavox Odyssey, Atari 2600, NES та Commodore 64; системи 90-х і 2000-х років; сучасні консолі, як-от Nintendo Switch, Xbox Series X|S і PlayStation 5; а також консолі, про існування яких ви навіть не здогадувалися.`,
    ],
    contents: [
      { authors: [Authors['Еван Амос']], title: Books['Ігрові консолі 2.0. Історія у фотографіях від Atari до Xbox'] },
    ],
  },
  {
    id: 10,
    title: Books['Всесвітній атлас тату'],
    coverImage: '017bf7a4-0498-11f0-81bb-005056857596_d88ee0ef-0498-11f0-81bb-005056857596.webp',
    authors: [Authors['Анна Фелісіті Фрідман']],
    description: [
      `Перед вами ілюстроване дослідження розмаїття стилів і найвидатніших майстрів татуювання від давніх часів до сьогодення. Мистецтво та практика татуювання зазнали радикальних змін у 21 столітті, оскільки його популярність стрімко зросла. Дедалі більше тату-майстрів відшуковують втрачені традиції й водночас впроваджують інновації у своїй роботі. З'явилося величезне розмаїття стилів, жанрів і технік: від геометричного блекворку до яскравих, живописних стилів, від ручного татуювання до машинних малюнків.`,
      `У цьому виданні, що містить понад 700 чудових ілюстрацій, ви дізнаєтеся про історичні та сучасні практики татуювання в Європі, Америці, на Близькому Сході, в Африці, Азії, Австралії та на островах Тихого океану. Кожен розділ, присвячений певному географічному регіону, містить захопливу розповідь експертів з татуювання, які досліджують історію та традиції цього регіону, а також сучасні стилі та тенденції. Всесвітній атлас татуювання також відстежує розвиток стилів від їхнього корінного середовища до діаспорних спільнот, де вони часто трансформуються у креативні, мультикультурні дизайни.`,
    ],
    contents: [
      { authors: [Authors['Анна Фелісіті Фрідман']], title: Books['Всесвітній атлас тату'] },
    ],
  },
  {
    id: 11,
    title: Books['1984. Графічний роман'],
    coverImage: '733dae87-1d62-11ed-8173-0050568ef5e6_e14ccb25-4565-11ed-8175-0050568ef5e6.webp',
    authors: [Authors['Джордж Орвелл'], Authors['Ксав\'є Кост']],
    description: [
      `Нове прочитання класичної антиутопії. Яскравіші враження від зображених подій. Ще більш моторошно від їхньої життєвості.`,
      `Вінстон Сміт — рядовий партійний функціонер у тоталітарній державі, робота якого полягає в тому, щоб переписувати історію, підганяючи її під поточні потреби. Проте прагнення Вінстона до правди змушує його таємно повстати проти уряду. Він заводить заборонений роман з однодумицею Джулією, і вони вступають у Братство – групу опозиціонерів. За парою пильно стежать. Власне, плакати по всьому місту попереджали: «Великий Брат стежить за тобою».`,
    ],
    contents: [
      { authors: [Authors['Джордж Орвелл'], Authors['Ксав\'є Кост']], title: Books['1984. Графічний роман'] },
    ],
  },
  {
    id: 12,
    title: Books['Невидимі планети. Антологія сучасної китайської наукової фантастики'],
    coverImage: 'yIuEN43JkouYIiLLbsMJKgcU6AmsmtLBY1R88kvC.jpeg.webp',
    authors: [Authors['Кен Лю']],
    description: [
      `Збірка «Невидимі планети», впорядкована Кеном Лю, — це захоплива новаторська антологія короткої науково-фантастичної прози, що складається з одинадцяти провокативних коротких творів сучасних китайських авторів.`,
      `Розмаїття стилів — від сюрреалістичних фантазій до серйозної наукової фантастики, і навіть казки — задовольнить найвибагливіших поціновувачів жанру. Останній розділ містить три есе, присвячені дослідженню китайської наукової фантастики.`,
      `Зокрема в «Найгіршому із Усесвітів і найкращій Землі серед усіх можливих варіантів» Лю Цисінь пропонує історичний огляд китайської наукової фантастики та висвітлює його власне становлення як провідного китайського письменника в цьому контексті.`,
    ],
    contents: [
      { authors: [Authors['Чень Цюфань']], title: Books['Рік Щура'] },
      { authors: [Authors['Чень Цюфань']], title: Books['Ліцзянські рибки'] },
      { authors: [Authors['Чень Цюфань']], title: Books['Шацзуйська квітка'] },
      { authors: [Authors['Ся Цзя']], title: Books['Тонтонове літо'] },
      { authors: [Authors['Ся Цзя']], title: Books['Нічна прогулянка дракона'] },
      { authors: [Authors['Ма Боюн']], title: Books['Місто тиші'] },
      { authors: [Authors['Хао Цзінфан']], title: Books['Невидимі планети'] },
      { authors: [Authors['Хао Цзінфан']], title: Books['Складаний Пекін'] },
      { authors: [Authors['Тан Фей']], title: Books['Сороміцька оповідка'] },
      { authors: [Authors['Чен Цзінбо']], title: Books['Гробниця світляків'] },
      { authors: [Authors['Лю Цисінь']], title: Books['Опіка над Богом'] },
    ],
  },
]
