import { BooksCollection } from '../collections';

/** Book to cover image reference */
export const BookToCoverRef: Record<BooksCollection, string> = {
  [BooksCollection['Облудні сосни. Книга 1. Сосни']]: 'Облудні сосни. Книга 1. Сосни.webp',
  [BooksCollection['Облудні сосни. Книга 2. Облуда']]: 'Облудні сосни. Книга 2. Облуда.webp',
  [BooksCollection['Облудні сосни. Книга 3. Останнє місто']]: 'Облудні сосни. Книга 3. Останнє місто.webp',
  [BooksCollection['Невидимі планети. Антологія сучасної китайської наукової фантастики']]:
    'Невидимі планети. Антологія сучасної китайської наукової фантастики.webp',
  [BooksCollection.Апґрейд]: 'Апґрейд.webp',
  [BooksCollection.Рекурсія]: 'Рекурсія.webp',
  [BooksCollection['Темна матерія']]: 'Темна матерія.webp',
  [BooksCollection.Убік]: 'Убік.webp',
  [BooksCollection['Чи мріють андроїди про електричних овець?']]: 'Чи мріють андроїди про електричних овець.webp',
  [BooksCollection['Ігрові консолі 2.0. Історія у фотографіях від Atari до Xbox']]:
    'Ігрові консолі 2.0. Історія у фотографіях від Atari до Xbox.webp',
  [BooksCollection['Всесвітній атлас тату']]: 'Всесвітній атлас тату.webp',
  [BooksCollection['1984. Графічний роман']]: '1984. Графічний роман.webp',
  [BooksCollection['Експансія. Книга 1. І прокинеться Левіафан']]:
    'Експансія. Книга 1. І прокинеться Левіафан.webp',
  [BooksCollection['Експансія. Книга 2. Війна Калібана']]: 'Експансія. Книга 2. Війна Калібана.webp',
  [BooksCollection['Експансія. Книга 3. Брама Абаддона']]: 'Експансія. Книга 3. Брама Абаддона.webp',
  [BooksCollection['Експансія. Книга 4. На згарищі Сіболи']]: 'Експансія. Книга 4. На згарищі Сіболи.webp',
  [BooksCollection['Експансія. Книга 5. Ігри Немезиди']]: 'Експансія. Книга 5. Ігри Немезиди.webp',
  [BooksCollection['Експансія. Книга 6. У попелі Вавилону']]: 'Експансія. Книга 6. У попелі Вавилону.webp',
  [BooksCollection['Експансія. Книга 7. Сходження Персеполісу']]: 'Експансія. Книга 7. Сходження Персеполісу.webp',
}
